---
kind: property
id: P:Autodesk.Revit.DB.ScheduleDefinition.IsKeySchedule
source: html/fde24376-4e81-a336-7944-22c7ac31341a.htm
---
# Autodesk.Revit.DB.ScheduleDefinition.IsKeySchedule Property

Indicates if the schedule is a key schedule.

## Syntax (C#)
```csharp
public bool IsKeySchedule { get; }
```

## Remarks
A key schedule displays abstract "key" elements that can be used to
 populate parameters of ordinary model elements.